stm32mpu-oem/STM32CubeMP2/Drivers/BSP/STM32MP257CXX_VALIDX/stm32mp257cxx_validx_camera.c
    if(id != OV5640_ID)
    {
      return BSP_ERROR_UNKNOWN_COMPONENT;
    }

    CameraDrv = (CAMERA_Drv_t *) &OV5640_CAMERA_Driver;
    CompObj = &OV5640Obj;
    CameraCap =&Cap;
  }

  ret = CameraDrv->Init(CompObj, Resolution, PixelFormat);
  if (ret != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  ret = CameraDrv->GetCapabilities(CompObj, CameraCap);
  if (ret != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}
#endif

/**
  * @brief  Register Bus IOs if component ID is OK
  * @retval error status
  */
#ifdef USE_CAMERA_SENSOR_IMX219
static int32_t IMX219_Probe(uint32_t Resolution, uint32_t PixelFormat)
{
  int32_t ret;
  IMX219_IO_t              IOCtx;
  uint32_t                  id;

  /* Only perform the init if the object already exist */
  if (!CompObj)
  {
    /* Configure the I2C driver */
    IOCtx.Address     = CAMERA_IMX219_ADDRESS;
    IOCtx.Init        = BSP_I2C2_Init;
    IOCtx.DeInit      = BSP_I2C2_DeInit;
    IOCtx.ReadReg     = BSP_I2C2_ReadReg16;
    IOCtx.WriteReg    = BSP_I2C2_WriteReg16;
    IOCtx.GetTick     = BSP_GetTick;

    ret = IMX219_RegisterBusIO (&IMX219Obj, &IOCtx);
    if (ret != IMX219_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }

    ret = IMX219_ReadID(&IMX219Obj, &id);
    if (ret != IMX219_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }

    if(id != IMX219_CHIP_ID)
    {
      return BSP_ERROR_UNKNOWN_COMPONENT;
    }

    CameraDrv = (CAMERA_Drv_t *) &IMX219_CAMERA_Driver;
    CompObj = &IMX219Obj;
    CameraCap =&Cap;
  }

  ret = CameraDrv->Init(CompObj, Resolution, PixelFormat);
  if (ret != IMX219_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  ret = CameraDrv->GetCapabilities(CompObj, CameraCap);
  if (ret != IMX219_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}
#endif

#ifdef USE_CAMERA_SENSOR_IMX335
static int32_t IMX335_Probe(uint32_t Resolution, uint32_t PixelFormat)
{
  int32_t ret;
  IMX335_IO_t              IOCtx;
  uint32_t                  id;

  /* Only perform the init if the object already exist */
  if (!CompObj)
  {
    /* Configure the I2C driver */
    IOCtx.Address     = CAMERA_IMX335_ADDRESS;
    IOCtx.Init        = BSP_I2C2_Init;
    IOCtx.DeInit      = BSP_I2C2_DeInit;
    IOCtx.ReadReg     = BSP_I2C2_ReadReg16;
    IOCtx.WriteReg    = BSP_I2C2_WriteReg16;
    IOCtx.GetTick     = BSP_GetTick;

    ret = IMX335_RegisterBusIO (&IMX335Obj, &IOCtx);
    if (ret != IMX335_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }

    ret = IMX335_ReadID(&IMX335Obj, &id);
    if (ret != IMX335_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }

    if(id != IMX335_CHIP_ID)
    {
      return BSP_ERROR_UNKNOWN_COMPONENT;
    }

    CameraDrv = (CAMERA_Drv_t *) &IMX335_CAMERA_Driver;
    CompObj = &IMX335Obj;
    CameraCap =&Cap;
  }

  ret = CameraDrv->Init(CompObj, Resolution, PixelFormat);
  if (ret != IMX335_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  ret = CameraDrv->GetCapabilities(CompObj, CameraCap);
  if (ret != IMX335_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}
#endif

int32_t BSP_CAMERA_SetColorbarMode(uint32_t Instance, uint32_t Mode)
{
  UNUSED(Instance);

  #ifdef USE_CAMERA_SENSOR_OV5640
  if(OV5640_ColorbarModeConfig(CompObj, Mode) != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
#else
  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif
}

int32_t BSP_CAMERA_SetPolarities(uint32_t Instance, uint32_t Pclk, uint32_t Href, uint32_t Vsync)
{
  UNUSED(Instance);

#ifdef USE_CAMERA_SENSOR_OV5640
  if(OV5640_SetPolarities(CompObj,
               Pclk ? OV5640_POLARITY_PCLK_HIGH : OV5640_POLARITY_PCLK_LOW,
               Href ? OV5640_POLARITY_HREF_HIGH : OV5640_POLARITY_HREF_LOW,
               Vsync ? OV5640_POLARITY_VSYNC_HIGH : OV5640_POLARITY_VSYNC_LOW) != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
#else
  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif
}

int32_t BSP_CAMERA_SetSynchroCodes(uint32_t Instance, uint32_t FSC, uint32_t LSC, uint32_t LEC, uint32_t FEC)
{
  UNUSED(Instance);

#ifdef USE_CAMERA_SENSOR_OV5640
  OV5640_SyncCodes_t SyncCode;

  SyncCode.FrameStartCode = FSC;
  SyncCode.LineStartCode = LSC;
  SyncCode.LineEndCode = LEC;
  SyncCode.FrameEndCode = FEC;

  if (OV5640_EmbeddedSynchroConfig(CompObj, &SyncCode) != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
#else
  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
